var MrgCcstList=[
    // {
    //     value:"0",
    //     text:"未婚"
    // },
    // {
    //     value:"1",
    //     text:"已婚"
    // },
    // {
    //     value:"2",
    //     text:"离异"
    // },
    // {
    //     value:"3",
    //     text:"其他"
    // },
    // {
    //     value:"4",
    //     text:"丧偶"
    // },
    {
        value:"5",
        text:"结婚有子女"
    },
    {
        value:"6",
        text:"单身有子女"
    },
    {
        value:"7",
        text:"结婚无子女"
    },
    {
        value:"8",
        text:"单身无子女及其他情况"
    },
];
var MrgCcstObj={
    "0":"未婚",
    "1":"已婚",
    "2":"离异",
    "3":"其他",
    "4":"丧偶",
    "5":"结婚有子女",
    "6":"单身有子女",
    "7":"结婚无子女",
    "8":"单身无子女及其他情况",
};
var NaPlcList=[
    {
        value:"陕西省",
        text:"陕西省"
    },

];
var NaPlcObj={
    "陕西省":"陕西省"
};



var CtyRsdnCcstList=[
    {
        value:"1",
        text:"本市自有产权房（含家庭、含自建房）"
    },
    {
        value:"2",
        text:"与父母或亲属合住"
    },
    {
        value:"3",
        text:"租住房"
    },
    
];
var CtyRsdnCcstObj={
    "1":"本市自有产权房（含家庭、含自建房）",
    "2":"与父母或亲属合住",
    "3":"租住房",
};



var FamStcList=[
    {
        value:"1",
        text:"家庭供养人员≤1"
    },
    {
        value:"2",
        text:"家庭供养人员≥2或家庭人员有慢性病、70岁以上人员"
    },
    // {
    //     value:"3",
    //     text:"70岁以上人员"
    // },
    
];
var FamStcObj={
    "1":"家庭供养人员≤1",
    "2":"家庭供养人员≥2或家庭人员有慢性病、70岁以上人员",
};

var HltCcstList=[
    {
        value:"1",
        text:"健康"
    },
    {
        value:"2",
        text:"其它"
    },
   
    
];
var HltCcstObj={
    "1":"健康",
    "2":"其它",
};

var PltErcList=[
    {
        value:"1",
        text:"年限>6年"
    },
    {
        value:"2",
        text:"4<年限≤6年"
    },
    {
        value:"3",
        text:"2<年限≤4年"
    },
    {
        value:"4",
        text:"年限≤2年"
    },
    
];
var PltErcObj={
    "1":"年限>6年",
    "2":"4<年限≤6年",
    "3":"2<年限≤4年",
    "4":"年限≤2年",
};


var CurTobEqmtList=[
    {
        value:"1",
        text:"砖混结构、自动化烘烤设备"
    },
    {
        value:"2",
        text:"彩钢保温板房、非自动化烘烤设备"
    },
    // {
    //     value:"3",
    //     text:"彩钢保温板房"
    // },
    // {
    //     value:"4",
    //     text:"非自动化烘烤设备"
    // },
    
];
var CurTobEqmtObj={
    "1":"砖混结构、自动化烘烤设备",
    "2":"彩钢保温板房、非自动化烘烤设备",
    // "3":"彩钢保温板房",
    // "4":"非自动化烘烤设备",
};



var AstList=[
    {
        value:"1",
        text:"房产（含自建房）"
    },
    {
        value:"2",
        text:"车辆"
    },
    {
        value:"3",
        text:"农机具"
    },
    
    
];
var AstObj={
    "1":"房产（含自建房）",
    "2":"车辆",
    "3":"农机具",
};

var ifSLList=[
    {
        value:"1",
        text:"是"
    },
    {
        value:"0",
        text:"否"
    }
    
    
];
var ifSLObj={
    "1":"是",
    "0":"否",
};


var NtnObj={
    "01":"汉族",
    "02":"蒙古族",
    "03":"回族",
    "04":"藏族",
    "05":"维吾尔族",
    "06":"苗族",
    "07":"彝族",
    "08":"壮族",
    "09":"布依族",
    "10":"朝鲜族",
    "11":"满族",
    "12":"侗族",
    "13":"瑶族",
    "14":"白族",
    "15":"土家族",
    "16":"哈尼族",
    "17":"哈萨克族",
    "18":"傣族",
    "19":"黎族",
    "20":"僳僳族",
    "21":"佤族",
    "22":"畲族",
    "23":"高山族",
    "24":"拉祜族",
    "25":"水族",
    "26":"东乡族",
    "27":"纳西族",
    "28":"景颇族",
    "29":"柯尔克孜族",
    "30":"土族",
    "31":"达斡尔族",
    "32":"仫佬族",
    "33":"羌族",
    "34":"布朗族",
    "35":"撒拉族",
    "36":"毛南族",
    "37":"仡佬族",
    "38":"锡伯族",
    "39":"阿昌族",
    "40":"普米族",
    "41":"塔吉克族",
    "42":"怒族",
    "43":"乌孜别克族",
    "44":"俄罗斯族",
    "45":"鄂温克族",
    "46":"德昂族",
    "47":"保安族",
    "48":"裕固族",
    "49":"京族",
    "50":"塔塔尔族",
    "51":"独龙族",
    "52":"鄂伦春族",
    "53":"赫哲族",
    "54":"门巴族",
    "55":"珞巴族",
    "56":"基诺族",
    "57":"其他/未知",
};

var NtnList=[];
for(const key in NtnObj){
    var obj={};
    obj.value=key;
    obj.text=NtnObj[key];
    NtnList.push(obj)
};


var sexObj={
    "F":"女",
    "M":"男",
};
var sexList=[
    {
        value:"F",
        text:"女"
    },
    {
        value:"M",
        text:"男"
    }
];

