const DICT = {
    //数据阶段
    'DataStage': {
        '-1': '待分配',
        '0': '待对接',
        '1': '已对接',
        '2': '资料收集中',
        '3': '审查审批中',
        '4': '签约中',
        '5': '放款',
        '6': '终止',
        '7': '不予准入',
    },
    //客户类型
    'CustType': {
        '1': '小微企业',
        '2': '个体工商户',
        '3': '农户',
    },
    //统计日期搜索类型
    'StatisticDateType': {
        '1': '按日',
        '2': '按月',
        '3': '按年',
        '4': '累计',
    },
    //统计角色   ZONGHANG("1","总行视觉"),  LEADER("2","领导视角");
    'StatisticRoleType': {
        '1': '总行视觉',
        '2': '领导视角',
    },

    //所属行业（个人、企业）：1批发零售、2餐饮住宿、3制造加工、4物流运输农林牧渔、5其他 
    'IndustryPersonOrEnterprise': {
        '1': '批发零售',
        '2': '餐饮住宿',
        '3': '制造加工',
        '4': '农林牧渔',
        '5': '物流运输',
        '6': '其他',
    },
    //所属行业农户：1粮食种植、2果蔬种植、3苗木种植、4畜禽养殖、5农机维护、6种子化肥、7物流运输、8农事中介、9电商销售、10其他   ZONGHANG("1","总行视觉"),  LEADER("2","领导视角");
    'IndustryFarmer': {
        '1': '粮食种植',
        '2': '果蔬种植',
        '3': '苗木种植',
        '4': '畜禽养殖',
        '5': '农机维护',
        '6': '种子化肥',
        '7': '物流运输',
        '8': '农事中介',
        '9': '电商销售',
        '10': '其他',
        '11': '烟草种植',
    },
    //经营年限   1、1年以内 2、1—3年 3、3—5年 4、5年以上  111
    'OperatingYears': {
        '1': '1年以内',
        '2': '1—3年',
        '3': '3—5年',
        '4': '5年以上'
    },

    //资金需求    企业：1、50万以内 2、50—100万 3、100—200万 4、200—500万 5、500万以上 11
    'FundingRequEnterprise': {
        '1': '50万以内',
        '2': '50—100万 ',
        '3': '100—200万',
        '4': '200—500万',
        '5': '500万以上',
    },
    //资金需求  个人 1、10万以内 2、10—20万 3、20—50万 4、50—100万 5、100万以上  1111
    'FundingRequPerson': {
        '1': '10万以内',
        '2': '10—20万',
        '3': '20—50万',
        '4': '50—100万',
        '5': '100万以上',
    },
    // 资金需求 农户：1、5万以内 2、5—10万 3、10—20万 4、20—50万 5、50万以上  111
    'FundingRequFarmer': {
        '1': '5万以内',
        '2': '5—10万',
        '3': '10—20万',
        '4': '20—50万',
        '5': '50万以上',
    },
    // 用途 企业：1原材料或货品采购、2设备更新、3厂房建设、4工资发放、5短期周转、6其他  111 PurposeEnterprise
    'PurposeEnterprise': {
        '1': '原材料或货品采购',
        '2': '设备更新',
        '3': '厂房建设',
        '4': '工资发放',
        '5': '短期周转',
        '6': '其他',
    },
    //用途 个人  1原材料或货品采购、2支付房租水电、3经营场所装修、4设备更新、5短期周转、6其他  111
    'PurposePerson': {
        '1': '原材料或货品采购',
        '2': '支付房租水电',
        '3': '经营场所装修',
        '4': '设备更新',
        '5': '短期周转',
        '6': '其他',
    },
    //用途 农户 1购买种子化肥、2购买包装用品、3支付农机服务、4支付物流运输、5支付采摘款项、6家庭装修、7购置家电、8购置农机、9购置汽车、10其他   1111

    'PurposeFarmer': {
        '1': '购买种子化肥',
        '2': '购买包装用品',
        '3': '支付农机服务',
        '4': '支付物流运输',
        '5': '支付采摘款项',
        '6': '家庭装修',
        '7': '购置家电',
        '8': '购置农机',
        '9': '购置汽车',
        '10': '其他',
    },

    // 银行联络时间：1随时联系、2周一至周五工作时间联系     1111
    'ContactTime': {
        '1': '随时联系',
        '2': '周一至周五工作时间联系',
    },
    //渠道：1银行海报、2纸杯、3抽纸盒、4便民服务袋、5微信朋友圈、6银行工作人员
    'Channal': {
        '1': '银行海报',
        '2': '纸杯',
        '3': '抽纸盒',
        '4': '便民服务袋',
        '5': '微信朋友圈',
        '6': '银行工作人员',
    },

    'Isindiviual':{
        '1': '是',
        '2': '否',
    }

}
function toOptions(dicName){
    const dict =  DICT[dicName];
    if (!dict) return[];
    return Object.entries(dict).map(([value,label]) => ({value,label})) 
}